# Задание!
# Нужно написать программу, которая будет считывать со стандартного ввода целочисленные границы
# промежутка (сначала левая, потом правая, каждая на отдельной строке). А дальше будет
# считывать целые числа со стандартного ввода пока не встретит пустую строку, которая будет
# означать конец ввода. Нужно будет проверить входят ли все введенные числа в промежуток,
# проверка включает в себя границы промежутка.

out = []
# Функция input() всегда возвращает строку. Для принятия целых чисел используем int()
g1 = int(input())
# Функция input() всегда возвращает строку. Для принятия целых чисел используем int()
g2 = int(input())
# Команда g3 = input () помещена на конец цикла, чтобы сначала проверить текущее значение
# переменной g3, и только после его обработки требовать от пользователя новое значение.
while (g3 := input()) != "":
    out.append(int(g3))

print(all([g1 <= i <= g2 for i in out]))