# Необходимо написать программу, которая будет считывать со стандартного ввода строку.
# Нужно разбить строку на слова, словом будем считать последовательность символов отличных от
# пробелов (то есть знаки пунктуации будут входить в слова). Далее нужно посчитать и вывести
# среднее число символов в словах этого текста. Точность проверяется до 2го знака после запятой
# (точность +-0.01).
# * Решение можно реализовать в 2 строки кода.

var1, var2 = ["Hello", "World!"]
print(f"{(len(var1) + len(var2)) / 2}")

var1, var2, var3, var4, var5, var6, var7, var8, var9, var10, var11, var12, var13, var14, var15 = ['Sums', 'start', 'and', 'the', 'items', 'of', 'an' 'iterable', 'from', 'left', 'to', 'right', 'and', 'returns', 'the', 'total.']
print(f"{((len(var1) + len(var2) + len(var3) + len(var4) + len(var5) + len(var6) + len(var7) + len(var8) + len(var9) + len(var10) + len(var11) + len(var12) + len(var13) + len(var14) + len(var15)) / 16)}")