# Задание!
# Необходимо написать программу, которая будет считывать со стандартного ввода строку и
# выводить уникальные символы, встретившиеся в этой строке, в лексикографическом порядке
# по возрастанию. Символы из входа нужно приводить к нижнему регистру. Символ пробела
# не нужно учитывать при формировании результата. Выходные символы нужно разделять пробелом.

def unique_chars(s):

# Убираются пробелы и приводятся к нижнему регистру
    s = s.replace(' ', '').lower()
# Задаётся список состоящий только из уникальных символов
    lst = list(set(s))
# Производится сортировка списка
    sorted_lst = sorted(lst)
#  Символы разделяются пробелами
    return ' '.join(sorted_lst)

print(f"****Start of input***")
string = input()
print(f"******End of input***")
print(f"*****-----------*****")
print(f"***Start of Result***")
print(unique_chars(string))
print(f"*****End of Result***")