# Задание!
#
# Необходимо написать программу, которая будет считывать последовательности измерений.
# В каждой последовательности нужно выбрать максимальное значение, а в итоге вывести
# отсортированный по убыванию список этих макс значений, разделенных символом “;”.
# Во входных данных в первой строке будет задано целое положительное число – сколько записей
# нужно обработать, причем самих записей может быть больше чем это число, это нужно учесть.
# Значения в рамках одной записи разделены пробелом, минимальное число значений в записи – 1.
# Записи разделены переводом строки.

s = []
try:
    for dataIn in iter(input, ''):
        s.append(max(map(int, dataIn .rstrip('\n').split())))

# Чтобы избежать ошибки EOFError вводим текст ниже
except EOFError as e:
    print(end='')

print(";".join(map(str, sorted(s[1:s[0]+1], reverse=True))))