# Необходимо написать программу, которая будет считывать со стандартного ввода
# строку "Hello World!@#%", далее будет приводить ее к нижнему регистру, а также будет
# заменять символы “!”, “%”, “#”, “@” на пустую строку. В итоге нужно будет вывести в первой
# строке число замененных символов, а во второй преобразованную строку.

print(f'-----')

# Принимаем в работу неформатированную строку "Hello World!@#%"
a="Hello World!@#%"
simbol="!@#%"

# Подсчитываем количество символов "!@#%" в строке
print(f"{len(simbol)}")

# Чтобы узнать какой  по порядку символ "!" в строке,  используем "find" (11)
# print(f"{a.find('!')}")

# Обрезаем строку до символа !
b = a.split("!")[0].strip()

# Приводим выводимый текст в нижний регистр
print(f"{b.lower()}")