# Задание!
# Задаём имя и выдаём приветствие этому имени.
#
# Чтобы, отделить текст от ссылки выводим чёрточки.
# print("-----")
#
# Если необходимо ввести имя вручную запрашиваем вво имени.
# name = input("Введите Ваше имя: ").
#
# Вариант с заданным именем.
# Присваиваем переменной 'name' значение 'Ivan'.
name = ('Ivan')
# Чтобы отделить текст ввода от текста результата выводим чёрточки.
print("-----")
print("Hello, " + name)
# Чтобы отделить текст результата от системного текста о наличии\отсутствии ошибок выводим чёрточки.
print("-----")