# Необходимо написать программу, которая будет считывать три числа и выводить
# их в определенном формате. Первое число целое, второе с плавающей точкой,
# третье целое неотрицательное. По примерам необходимо определить требуемый формат данных.

# Задание 1
print("-----")
print(f"Задание 1:")
# Выводим 102, добавляя '+' и нули перед цифрой, длина строки 10 символов
print(f"{102:0=+10}")
# Выводим дробное число, добавляя '#' перед ним и обрезая количество символов до 2
a=3.1415926535
print(f"{a:#=10,.2f}")
# Выводим число в бинарном формате, добавляя нули в начало и "_" для деления цифр
# на четвёрки
a=1127
print(f"{a:0=19_b}")
print("-----")

# Задание 2
print(f"Задание 2:")
# Выводим -1024, добавляя нули после минуса, длина строки 10 символов
print(f"{-1024:0=10}")
# Выводим отрицательное дробное число, добавляя '#' перед минусом и обрезая количество
# символов до 2
a=-123.7
print(f"{a:#>10,.2f}")
# Выводим число в бинарном формате, добавляя нули в начало и "_" для деления цифр
# на четвёрки
a=65535
print(f"{a:0=19_b}")